In [108]:
import pandas as pd
import numpy as np

In [109]:
df=pd.DataFrame(
    data=np.random.randint(
        low=1,
        high=6,
        size=(5,3)
    ),
    columns=["col_1","col_2","col_3"]
)

In [110]:
df.at[0,"col_1"]=None
df.at[2,"col_2"]=None
df.at[4,"col_3"]=None

In [111]:
df

   col_1  col_2  col_3
0    NaN    4.0    2.0
1    5.0    1.0    2.0
2    1.0    NaN    1.0
3    5.0    4.0    2.0
4    2.0    2.0    NaN

In [112]:
df.sum(axis=0, skipna=True)

col_1    13.0
col_2    11.0
col_3     7.0
dtype: float64

In [113]:
df.sum(axis=0, skipna=False)# (NaN+-*/ anything is NaN)

col_1   NaN
col_2   NaN
col_3   NaN
dtype: float64

In [114]:
df.sum(
    axis=1,
    skipna=True
)

0     6.0
1     8.0
2     2.0
3    11.0
4     4.0
dtype: float64

In [115]:
df.sum(
    axis=1,
    skipna=False
)

0     NaN
1     8.0
2     NaN
3    11.0
4     NaN
dtype: float64

In [116]:
df.cumsum(axis=0)

   col_1  col_2  col_3
0    NaN    4.0    2.0
1    5.0    5.0    4.0
2    6.0    NaN    5.0
3   11.0    9.0    7.0
4   13.0   11.0    NaN

In [117]:
df.cumsum(axis=1)

   col_1  col_2  col_3
0    NaN    4.0    6.0
1    5.0    6.0    8.0
2    1.0    NaN    2.0
3    5.0    9.0   11.0
4    2.0    4.0    NaN

In [118]:
df.mean(axis=0)

col_1    3.25
col_2    2.75
col_3    1.75
dtype: float64

In [119]:
df.mean(axis=1)

0    3.000000
1    2.666667
2    1.000000
3    3.666667
4    2.000000
dtype: float64

In [120]:
df.mean(axis=0, skipna=True)

col_1    3.25
col_2    2.75
col_3    1.75
dtype: float64

In [121]:
df.mean(axis=0, skipna=False)

col_1   NaN
col_2   NaN
col_3   NaN
dtype: float64

In [122]:
df

   col_1  col_2  col_3
0    NaN    4.0    2.0
1    5.0    1.0    2.0
2    1.0    NaN    1.0
3    5.0    4.0    2.0
4    2.0    2.0    NaN

In [123]:
df.cumprod(axis=0, skipna=False)

   col_1  col_2  col_3
0    NaN    4.0    2.0
1    NaN    4.0    4.0
2    NaN    NaN    4.0
3    NaN    NaN    8.0
4    NaN    NaN    NaN

In [124]:
df.cumprod(axis=1, skipna=False)

   col_1  col_2  col_3
0    NaN    NaN    NaN
1    5.0    5.0   10.0
2    1.0    NaN    NaN
3    5.0   20.0   40.0
4    2.0    4.0    NaN

In [125]:
df.cumprod(axis=0)

   col_1  col_2  col_3
0    NaN    4.0    2.0
1    5.0    4.0    4.0
2    5.0    NaN    4.0
3   25.0   16.0    8.0
4   50.0   32.0    NaN

In [126]:
df.cumprod(axis=1)

   col_1  col_2  col_3
0    NaN    4.0    8.0
1    5.0    5.0   10.0
2    1.0    NaN    1.0
3    5.0   20.0   40.0
4    2.0    4.0    NaN

In [127]:
df.count(axis=0)

col_1    4
col_2    4
col_3    4
dtype: int64

In [128]:
df.count(axis=1)

0    2
1    3
2    2
3    3
4    2
dtype: int64

In [129]:
df

   col_1  col_2  col_3
0    NaN    4.0    2.0
1    5.0    1.0    2.0
2    1.0    NaN    1.0
3    5.0    4.0    2.0
4    2.0    2.0    NaN

In [130]:
df.median()

col_1    3.5
col_2    3.0
col_3    2.0
dtype: float64

In [131]:
df.count()

col_1    4
col_2    4
col_3    4
dtype: int64

In [132]:
df.count(
    axis=1,
    numeric_only=True
)

0    2
1    3
2    2
3    3
4    2
dtype: int64

In [133]:
df

   col_1  col_2  col_3
0    NaN    4.0    2.0
1    5.0    1.0    2.0
2    1.0    NaN    1.0
3    5.0    4.0    2.0
4    2.0    2.0    NaN

In [134]:
df.min()

col_1    1.0
col_2    1.0
col_3    1.0
dtype: float64

In [135]:
df.min(
    axis=1,
    skipna=True,
    numeric_only=True
)

0    2.0
1    1.0
2    1.0
3    2.0
4    2.0
dtype: float64

In [136]:
df.min(
    axis=1,
    skipna=False,
    numeric_only=True
)

0    NaN
1    1.0
2    NaN
3    2.0
4    NaN
dtype: float64

In [137]:
df.max(
    axis=0,
    numeric_only=True
)

col_1    5.0
col_2    4.0
col_3    2.0
dtype: float64

In [138]:
df.max(
    axis=1,
    numeric_only=True
)

0    4.0
1    5.0
2    1.0
3    5.0
4    2.0
dtype: float64

In [139]:
df

   col_1  col_2  col_3
0    NaN    4.0    2.0
1    5.0    1.0    2.0
2    1.0    NaN    1.0
3    5.0    4.0    2.0
4    2.0    2.0    NaN

In [140]:
df.at[2,"col_1"]=None

In [141]:
df[["col_2","col_3"]].mode(
    axis=0,
    numeric_only=True,
)

   col_2  col_3
0    4.0    2.0

In [142]:
df[["col_1"]].mode(
    axis=0,
    numeric_only=True,
    dropna=True
)

   col_1
0    5.0

In [143]:
df[["col_1"]].mode(
    axis=0,
    numeric_only=True,
    dropna=False
)

   col_1
0    5.0
1    NaN

In [144]:
pd.Series([1,2,3,-45,-4]).abs()

0     1
1     2
2     3
3    45
4     4
dtype: int64

In [145]:
df.cummin()

   col_1  col_2  col_3
0    NaN    4.0    2.0
1    5.0    1.0    2.0
2    NaN    NaN    1.0
3    5.0    1.0    1.0
4    2.0    1.0    NaN

In [146]:
df2=df.fillna(3)

In [147]:
df

   col_1  col_2  col_3
0    NaN    4.0    2.0
1    5.0    1.0    2.0
2    NaN    NaN    1.0
3    5.0    4.0    2.0
4    2.0    2.0    NaN

In [150]:
df.cummin(
    axis=0,
    skipna=True
)

   col_1  col_2  col_3
0    NaN    4.0    2.0
1    5.0    1.0    2.0
2    NaN    NaN    1.0
3    5.0    1.0    1.0
4    2.0    1.0    NaN

In [161]:
#NaN is considered minimum heree
df.cummin(
    axis=0,
    skipna=False
    
)

   col_1  col_2  col_3
0    NaN    4.0    2.0
1    NaN    1.0    2.0
2    NaN    NaN    1.0
3    NaN    NaN    1.0
4    NaN    NaN    NaN

In [ ]:
df.cummin(
    axis=1,
    skipna=True,
)

In [153]:
df2

   col_1  col_2  col_3
0    3.0    4.0    2.0
1    5.0    1.0    2.0
2    3.0    3.0    1.0
3    5.0    4.0    2.0
4    2.0    2.0    3.0

In [154]:
df1=df.copy()

In [155]:
df2

   col_1  col_2  col_3
0    3.0    4.0    2.0
1    5.0    1.0    2.0
2    3.0    3.0    1.0
3    5.0    4.0    2.0
4    2.0    2.0    3.0

In [157]:
df2.cummax(
    axis=1,
)

   col_1  col_2  col_3
0    3.0    4.0    4.0
1    5.0    5.0    5.0
2    3.0    3.0    3.0
3    5.0    5.0    5.0
4    2.0    2.0    3.0

In [158]:
df2.cummax(
    axis=0
)

   col_1  col_2  col_3
0    3.0    4.0    2.0
1    5.0    4.0    2.0
2    5.0    4.0    2.0
3    5.0    4.0    2.0
4    5.0    4.0    3.0

In [159]:
#NaN is considered maximum here
df1.cummax(
    axis=0,
    skipna=False
)

   col_1  col_2  col_3
0    NaN    4.0    2.0
1    NaN    4.0    2.0
2    NaN    NaN    2.0
3    NaN    NaN    2.0
4    NaN    NaN    NaN

In [165]:
df1.cummax(
    axis=1,
    skipna=False
)

   col_1  col_2  col_3
0    NaN    NaN    NaN
1    5.0    5.0    5.0
2    NaN    NaN    NaN
3    5.0    5.0    5.0
4    2.0    2.0    NaN

In [166]:
df1.prod(
    axis=1,
    skipna=True,
    numeric_only=True  
)

0     8.0
1    10.0
2     1.0
3    40.0
4     4.0
dtype: float64

In [167]:
df1.prod(
    axis=0,
    skipna=True,
    numeric_only=True
)

col_1    50.0
col_2    32.0
col_3     8.0
dtype: float64

In [168]:
df1.cumprod(
    axis=0,
    skipna=True
)

   col_1  col_2  col_3
0    NaN    4.0    2.0
1    5.0    4.0    4.0
2    NaN    NaN    4.0
3   25.0   16.0    8.0
4   50.0   32.0    NaN

In [169]:
df1

   col_1  col_2  col_3
0    NaN    4.0    2.0
1    5.0    1.0    2.0
2    NaN    NaN    1.0
3    5.0    4.0    2.0
4    2.0    2.0    NaN

In [170]:
df1.cumprod(
    axis=0,
    skipna=False
)

   col_1  col_2  col_3
0    NaN    4.0    2.0
1    NaN    4.0    4.0
2    NaN    NaN    4.0
3    NaN    NaN    8.0
4    NaN    NaN    NaN

In [171]:
df1.cumprod(
    axis=1, 
    skipna=False
)

   col_1  col_2  col_3
0    NaN    NaN    NaN
1    5.0    5.0   10.0
2    NaN    NaN    NaN
3    5.0   20.0   40.0
4    2.0    4.0    NaN

   col_1  col_2  col_3
0    NaN    4.0    2.0
1    5.0    1.0    2.0
2    NaN    NaN    1.0
3    5.0    4.0    2.0
4    2.0    2.0    NaN

In [174]:
df1.cumsum(
    axis=0,
    skipna=True
)

   col_1  col_2  col_3
0    NaN    4.0    2.0
1    5.0    5.0    4.0
2    NaN    NaN    5.0
3   10.0    9.0    7.0
4   12.0   11.0    NaN

In [175]:
df1.cumsum(
    axis=1,
    skipna=False
)

   col_1  col_2  col_3
0    NaN    NaN    NaN
1    5.0    6.0    8.0
2    NaN    NaN    NaN
3    5.0    9.0   11.0
4    2.0    4.0    NaN

In [177]:
df2.sum()

col_1    18.0
col_2    14.0
col_3    10.0
dtype: float64

In [176]:
df2.cumsum(
    axis=0
)

   col_1  col_2  col_3
0    3.0    4.0    2.0
1    8.0    5.0    4.0
2   11.0    8.0    5.0
3   16.0   12.0    7.0
4   18.0   14.0   10.0

In [178]:
df2.std(
    axis=0
)

col_1    1.341641
col_2    1.303840
col_3    0.707107
dtype: float64

In [180]:
#ddof = delta degrees of freedom
#ddof =1 for sample standard deviation
#ddof =0 for Population standard deviation

df2.std(
    axis=0,
    skipna=True,
    numeric_only=True,
    ddof=0
)

col_1    1.200000
col_2    1.166190
col_3    0.632456
dtype: float64

In [181]:
df1.std(
    axis=0,
    skipna=False,
    ddof=0
)

col_1   NaN
col_2   NaN
col_3   NaN
dtype: float64

In [189]:
df3=pd.DataFrame(
    {
        "A":["Mumbai","Delhi","Pune"],
        "B":[1,2, None]

    }
)

In [190]:
df3

        A    B
0  Mumbai  1.0
1   Delhi  2.0
2    Pune  NaN

In [192]:
#numeric_only = True, only the columns having numeric values will be considered
df3.std(
    axis=0,
    skipna=True,
    ddof=1, 
    numeric_only=True
)

B    0.707107
dtype: float64

In [203]:
df3

        A    B
0  Mumbai  1.0
1   Delhi  2.0
2    Pune  NaN

B    0.707107
dtype: float64

In [198]:
df3.var(
    axis=0,
    skipna=False,
    numeric_only=True,
)

B   NaN
dtype: float64

In [210]:
#s = sample standard daviation 
#N = sample size (NAN is not considered as sample)
#sem=standard error of mean

s=df3.std(
    axis=0,
    skipna=True,
    ddof=1,
    numeric_only=True
)

N=2

sem=s/np.sqrt(N)

print(sem)

B    0.5
dtype: float64

In [211]:
df3.sem(
    axis=0,
    skipna=True,
    ddof=1,
    numeric_only=True,

)

B    0.5
dtype: float64

In [212]:
#skewness of data
df2.skew(
    axis=0,
    skipna=True,
    numeric_only=True,
)

col_1    0.165635
col_2   -0.541387
col_3    0.000000
dtype: float64

In [213]:
df1.skew(
    axis=0,
    skipna=False,
    numeric_only=True
)

col_1   NaN
col_2   NaN
col_3   NaN
dtype: float64

In [214]:
df2.kurt(
    axis=0,
    skipna=True,
    numeric_only=True
)

col_1   -2.407407
col_2   -1.487889
col_3    2.000000
dtype: float64

In [215]:
df2.quantile(
    q=0.25,
    axis=0,
    numeric_only=True,
    
)

col_1    3.0
col_2    2.0
col_3    2.0
Name: 0.25, dtype: float64

In [216]:
df2

   col_1  col_2  col_3
0    3.0    4.0    2.0
1    5.0    1.0    2.0
2    3.0    3.0    1.0
3    5.0    4.0    2.0
4    2.0    2.0    3.0

In [226]:
s=pd.Series([1,2,3,5,6,7])

In [227]:
s.quantile(
    q=0.5, 
    interpolation = "lower"
)

3

In [228]:
s.quantile(
    q=0.5,
    interpolation="higher"
)

5

In [229]:
s.quantile(
    q=0.5, 
    interpolation="midpoint"
)

4.0

In [240]:
p=np.percentile(
    a=s.to_numpy(),
    q=35
)
print("percentile = ", p)


q= s.quantile(
    q=0.35,
    interpolation="nearest"
)

print("quantile = ", q)

#since p is 2.75 which is closest to 3 
#thus qunatile value at 0.35 percentile is 3 
#WHEN INTERPOLATION IS NEAREST

percentile =  2.75
quantile =  3